In [5]:
import pandas as pd
import numpy as np

# CSV

In [6]:
df = pd.read_csv('example.csv', sep = '	')

In [7]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  11  12  13  14

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df['e'] = df['a']**2 + df['c']

In [10]:
df

    a   b   c   d    e
0   0   1   2   3    2
1   4   5   6   7   22
2   8   9  10  11   74
3  11  12  13  14  134

In [12]:
df.to_csv('example_with_e.csv', index = False) #we don't want see index

In [13]:
df['txt'] = ["'Almaty'", "'Atyrau'", "'Astana'", "'Shymkent'"]

In [15]:
df.to_csv('example_with_e.csv', index = False)

# XLSX

In [19]:
df = pd.read_excel('example_excel.xlsx')
df

   Unnamed: 0   a   b  c    d
0           0  10  20  5   10
1           1   2   1  1   55
2           2   5   2  2  100

In [23]:
df.drop(columns = 'Unnamed: 0', inplace=True)

In [24]:
df

    a   b  c    d
0  10  20  5   10
1   2   1  1   55
2   5   2  2  100

In [66]:
sheet_2 = pd.read_excel('example_excel.xlsx', sheet_name = 'Лист2')

In [67]:
sheet_2

       Name  Age  Height
0     Ardak   19     165
1      Anar   19     158
2     Kadyr   21     181
3  Altynbek   23     185
4  Zhansaya    9     148

In [68]:
sheet_2['Permit'] = ['Yes' if i>18 else 'No' for i in sheet_2['Age']]

In [69]:
sheet_2

       Name  Age  Height Permit
0     Ardak   19     165    Yes
1      Anar   19     158    Yes
2     Kadyr   21     181    Yes
3  Altynbek   23     185    Yes
4  Zhansaya    9     148     No

In [70]:
sheet_2.to_excel('new_excel.xlsx')

# SQL

In [71]:
from sqlalchemy import create_engine

In [72]:
engine = create_engine('sqlite:///:memory:')

In [74]:
sheet_2.to_sql('data', engine)

In [77]:
sql_df = pd.read_sql('select * from data where Age>18', con = engine)

In [78]:
sql_df

   index      Name  Age  Height Permit
0      0     Ardak   19     165    Yes
1      1      Anar   19     158    Yes
2      2     Kadyr   21     181    Yes
3      3  Altynbek   23     185    Yes